espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_bt_api.h
enum sli_bt_response_id
{
    sli_bt_dfu_reset_response_id = 0x00,
    sli_bt_dfu_flash_set_address_response_id = 0x01,
    sli_bt_dfu_flash_upload_response_id = 0x02,
    sli_bt_dfu_flash_upload_finish_response_id = 0x03,
    sli_bt_system_hello_response_id = 0x00,
    sli_bt_system_start_bluetooth_response_id = 0x1c,
    sli_bt_system_stop_bluetooth_response_id = 0x1d,
    sli_bt_system_get_version_response_id = 0x1b,
    sli_bt_system_reset_response_id = 0x01,
    sli_bt_system_halt_response_id = 0x0c,
    sli_bt_system_linklayer_configure_response_id = 0x0e,
    sli_bt_system_set_tx_power_response_id = 0x17,
    sli_bt_system_get_tx_power_setting_response_id = 0x18,
    sli_bt_system_set_identity_address_response_id = 0x13,
    sli_bt_system_get_identity_address_response_id = 0x15,
    sli_bt_system_get_random_data_response_id = 0x0b,
    sli_bt_system_data_buffer_write_response_id = 0x12,
    sli_bt_system_data_buffer_clear_response_id = 0x14,
    sli_bt_system_get_counters_response_id = 0x0f,
    sli_bt_system_set_lazy_soft_timer_response_id = 0x1a,
    sli_bt_gap_set_privacy_mode_response_id = 0x01,
    sli_bt_gap_set_data_channel_classification_response_id = 0x02,
    sli_bt_gap_enable_whitelisting_response_id = 0x03,
    sli_bt_advertiser_create_set_response_id = 0x01,
    sli_bt_advertiser_configure_response_id = 0x12,
    sli_bt_advertiser_set_timing_response_id = 0x03,
    sli_bt_advertiser_set_channel_map_response_id = 0x04,
    sli_bt_advertiser_set_tx_power_response_id = 0x0b,
    sli_bt_advertiser_set_report_scan_request_response_id = 0x05,
    sli_bt_advertiser_set_random_address_response_id = 0x10,
    sli_bt_advertiser_clear_random_address_response_id = 0x11,
    sli_bt_advertiser_stop_response_id = 0x0a,
    sli_bt_advertiser_delete_set_response_id = 0x02,
    sli_bt_advertiser_set_phy_response_id = 0x06,
    sli_bt_advertiser_set_configuration_response_id = 0x07,
    sli_bt_advertiser_clear_configuration_response_id = 0x08,
    sli_bt_advertiser_set_data_response_id = 0x0f,
    sli_bt_advertiser_set_long_data_response_id = 0x0e,
    sli_bt_advertiser_start_response_id = 0x09,
    sli_bt_advertiser_start_periodic_advertising_response_id = 0x0c,
    sli_bt_advertiser_stop_periodic_advertising_response_id = 0x0d,
    sli_bt_legacy_advertiser_set_data_response_id = 0x00,
    sli_bt_legacy_advertiser_generate_data_response_id = 0x01,
    sli_bt_legacy_advertiser_start_response_id = 0x02,
    sli_bt_legacy_advertiser_start_directed_response_id = 0x03,
    sli_bt_extended_advertiser_set_phy_response_id = 0x00,
    sli_bt_extended_advertiser_set_data_response_id = 0x01,
    sli_bt_extended_advertiser_set_long_data_response_id = 0x02,
    sli_bt_extended_advertiser_generate_data_response_id = 0x03,
    sli_bt_extended_advertiser_start_response_id = 0x04,
    sli_bt_extended_advertiser_start_directed_response_id = 0x05,
    sli_bt_periodic_advertiser_set_data_response_id = 0x00,
    sli_bt_periodic_advertiser_set_long_data_response_id = 0x01,
    sli_bt_periodic_advertiser_start_response_id = 0x02,
    sli_bt_periodic_advertiser_stop_response_id = 0x03,
    sli_bt_scanner_set_parameters_response_id = 0x06,
    sli_bt_scanner_stop_response_id = 0x05,
    sli_bt_scanner_set_timing_response_id = 0x01,
    sli_bt_scanner_set_mode_response_id = 0x02,
    sli_bt_scanner_start_response_id = 0x03,
    sli_bt_sync_set_parameters_response_id = 0x02,
    sli_bt_sync_open_response_id = 0x00,
    sli_bt_sync_set_reporting_mode_response_id = 0x03,
    sli_bt_sync_close_response_id = 0x01,
    sli_bt_past_receiver_set_default_sync_receive_parameters_response_id = 0x00,
    sli_bt_past_receiver_set_sync_receive_parameters_response_id = 0x01,
    sli_bt_advertiser_past_transfer_response_id = 0x00,
    sli_bt_sync_past_transfer_response_id = 0x00,
    sli_bt_connection_set_default_parameters_response_id = 0x00,
    sli_bt_connection_set_default_preferred_phy_response_id = 0x01,
    sli_bt_connection_open_response_id = 0x04,
    sli_bt_connection_set_parameters_response_id = 0x06,
    sli_bt_connection_set_preferred_phy_response_id = 0x08,
    sli_bt_connection_disable_slave_latency_response_id = 0x03,
    sli_bt_connection_get_rssi_response_id = 0x02,
    sli_bt_connection_read_channel_map_response_id = 0x07,
    sli_bt_connection_set_power_reporting_response_id = 0x09,
    sli_bt_connection_set_remote_power_reporting_response_id = 0x0a,
    sli_bt_connection_get_tx_power_response_id = 0x0b,
    sli_bt_connection_get_remote_tx_power_response_id = 0x0c,
    sli_bt_connection_close_response_id = 0x05,
    sli_bt_connection_read_remote_used_features_response_id = 0x0d,
    sli_bt_connection_get_security_status_response_id = 0x0e,
    sli_bt_gatt_set_max_mtu_response_id = 0x00,
    sli_bt_gatt_discover_primary_services_response_id = 0x01,
    sli_bt_gatt_discover_primary_services_by_uuid_response_id = 0x02,
    sli_bt_gatt_find_included_services_response_id = 0x10,
    sli_bt_gatt_discover_characteristics_response_id = 0x03,
    sli_bt_gatt_discover_characteristics_by_uuid_response_id = 0x04,
    sli_bt_gatt_discover_descriptors_response_id = 0x06,
    sli_bt_gatt_set_characteristic_notification_response_id = 0x05,
    sli_bt_gatt_send_characteristic_confirmation_response_id = 0x0d,
    sli_bt_gatt_read_characteristic_value_response_id = 0x07,
    sli_bt_gatt_read_characteristic_value_from_offset_response_id = 0x12,
    sli_bt_gatt_read_multiple_characteristic_values_response_id = 0x11,
    sli_bt_gatt_read_characteristic_value_by_uuid_response_id = 0x08,
    sli_bt_gatt_write_characteristic_value_response_id = 0x09,
    sli_bt_gatt_write_characteristic_value_without_response_response_id = 0x0a,
    sli_bt_gatt_prepare_characteristic_value_write_response_id = 0x0b,
    sli_bt_gatt_prepare_characteristic_value_reliable_write_response_id = 0x13,
    sli_bt_gatt_execute_characteristic_value_write_response_id = 0x0c,
    sli_bt_gatt_read_descriptor_value_response_id = 0x0e,
    sli_bt_gatt_write_descriptor_value_response_id = 0x0f,
    sli_bt_gattdb_new_session_response_id = 0x00,
    sli_bt_gattdb_add_service_response_id = 0x01,
    sli_bt_gattdb_remove_service_response_id = 0x02,
    sli_bt_gattdb_add_included_service_response_id = 0x03,
    sli_bt_gattdb_remove_included_service_response_id = 0x04,
    sli_bt_gattdb_add_uuid16_characteristic_response_id = 0x05,
    sli_bt_gattdb_add_uuid128_characteristic_response_id = 0x06,
    sli_bt_gattdb_remove_characteristic_response_id = 0x07,
    sli_bt_gattdb_add_uuid16_descriptor_response_id = 0x08,
    sli_bt_gattdb_add_uuid128_descriptor_response_id = 0x09,
    sli_bt_gattdb_remove_descriptor_response_id = 0x0a,
    sli_bt_gattdb_start_service_response_id = 0x0b,
    sli_bt_gattdb_stop_service_response_id = 0x0c,
    sli_bt_gattdb_start_characteristic_response_id = 0x0d,
    sli_bt_gattdb_stop_characteristic_response_id = 0x0e,
    sli_bt_gattdb_commit_response_id = 0x0f,
    sli_bt_gattdb_abort_response_id = 0x10,
    sli_bt_gatt_server_set_max_mtu_response_id = 0x0a,
    sli_bt_gatt_server_get_mtu_response_id = 0x0b,
    sli_bt_gatt_server_find_attribute_response_id = 0x06,
    sli_bt_gatt_server_read_attribute_value_response_id = 0x00,
    sli_bt_gatt_server_read_attribute_type_response_id = 0x01,
    sli_bt_gatt_server_write_attribute_value_response_id = 0x02,
    sli_bt_gatt_server_send_user_read_response_response_id = 0x03,
    sli_bt_gatt_server_send_user_write_response_response_id = 0x04,
    sli_bt_gatt_server_send_notification_response_id = 0x0f,
    sli_bt_gatt_server_send_indication_response_id = 0x10,
    sli_bt_gatt_server_notify_all_response_id = 0x11,
    sli_bt_gatt_server_read_client_configuration_response_id = 0x12,
    sli_bt_gatt_server_send_user_prepare_write_response_response_id = 0x14,
    sli_bt_gatt_server_set_capabilities_response_id = 0x08,
    sli_bt_gatt_server_enable_capabilities_response_id = 0x0c,
    sli_bt_gatt_server_disable_capabilities_response_id = 0x0d,
    sli_bt_gatt_server_get_enabled_capabilities_response_id = 0x0e,
    sli_bt_gatt_server_read_client_supported_features_response_id = 0x15,
    sli_bt_nvm_save_response_id = 0x02,
    sli_bt_nvm_load_response_id = 0x03,
    sli_bt_nvm_erase_response_id = 0x04,
    sli_bt_nvm_erase_all_response_id = 0x01,
    sli_bt_test_dtm_tx_v4_response_id = 0x03,
    sli_bt_test_dtm_tx_cw_response_id = 0x04,
    sli_bt_test_dtm_rx_response_id = 0x01,
    sli_bt_test_dtm_end_response_id = 0x02,
    sli_bt_sm_configure_response_id = 0x01,
    sli_bt_sm_set_minimum_key_size_response_id = 0x14,
    sli_bt_sm_set_debug_mode_response_id = 0x0f,
    sli_bt_sm_add_to_whitelist_response_id = 0x13,
    sli_bt_sm_store_bonding_configuration_response_id = 0x02,
    sli_bt_sm_set_bondable_mode_response_id = 0x00,
    sli_bt_sm_set_passkey_response_id = 0x10,
    sli_bt_sm_increase_security_response_id = 0x04,
    sli_bt_sm_enter_passkey_response_id = 0x08,
    sli_bt_sm_passkey_confirm_response_id = 0x09,
    sli_bt_sm_bonding_confirm_response_id = 0x0e,
    sli_bt_sm_delete_bonding_response_id = 0x06,
    sli_bt_sm_delete_bondings_response_id = 0x07,
    sli_bt_sm_get_bonding_handles_response_id = 0x15,
    sli_bt_sm_get_bonding_details_response_id = 0x16,
    sli_bt_sm_find_bonding_by_address_response_id = 0x17,
    sli_bt_sm_set_bonding_key_response_id = 0x18,
    sli_bt_sm_set_legacy_oob_response_id = 0x19,
    sli_bt_sm_set_oob_response_id = 0x1a,
    sli_bt_sm_set_remote_oob_response_id = 0x1b,
    sli_bt_sm_set_bonding_data_response_id = 0x1c,
    sli_bt_ota_set_device_name_response_id = 0x01,
    sli_bt_ota_set_advertising_data_response_id = 0x02,
    sli_bt_ota_set_configuration_response_id = 0x03,
    sli_bt_ota_set_rf_path_response_id = 0x04,
    sli_bt_coex_set_options_response_id = 0x00,
    sli_bt_coex_set_parameters_response_id = 0x02,
    sli_bt_coex_set_directional_priority_pulse_response_id = 0x03,
    sli_bt_coex_get_counters_response_id = 0x01,
    sli_bt_l2cap_open_le_channel_response_id = 0x01,
    sli_bt_l2cap_send_le_channel_open_response_response_id = 0x02,
    sli_bt_l2cap_channel_send_data_response_id = 0x03,
    sli_bt_l2cap_channel_send_credit_response_id = 0x04,
    sli_bt_l2cap_close_channel_response_id = 0x05,
    sli_bt_cte_transmitter_set_dtm_parameters_response_id = 0x04,
    sli_bt_cte_transmitter_clear_dtm_parameters_response_id = 0x05,
    sli_bt_cte_transmitter_enable_connection_cte_response_id = 0x00,
    sli_bt_cte_transmitter_disable_connection_cte_response_id = 0x01,
    sli_bt_cte_transmitter_enable_connectionless_cte_response_id = 0x02,
    sli_bt_cte_transmitter_disable_connectionless_cte_response_id = 0x03,
    sli_bt_cte_transmitter_enable_silabs_cte_response_id = 0x06,
    sli_bt_cte_transmitter_disable_silabs_cte_response_id = 0x07,
    sli_bt_cte_receiver_set_dtm_parameters_response_id = 0x05,
    sli_bt_cte_receiver_clear_dtm_parameters_response_id = 0x06,
    sli_bt_cte_receiver_set_sync_cte_type_response_id = 0x09,
    sli_bt_cte_receiver_set_default_sync_receive_parameters_response_id = 0x0a,
    sli_bt_cte_receiver_set_sync_receive_parameters_response_id = 0x0b,
    sli_bt_cte_receiver_configure_response_id = 0x00,
    sli_bt_cte_receiver_enable_connection_cte_response_id = 0x01,
    sli_bt_cte_receiver_disable_connection_cte_response_id = 0x02,
    sli_bt_cte_receiver_enable_connectionless_cte_response_id = 0x03,
    sli_bt_cte_receiver_disable_connectionless_cte_response_id = 0x04,
    sli_bt_cte_receiver_enable_silabs_cte_response_id = 0x07,
    sli_bt_cte_receiver_disable_silabs_cte_response_id = 0x08,
    sli_bt_user_message_to_target_response_id = 0x00,
    sli_bt_user_manage_event_filter_response_id = 0x01,
    sli_bt_user_reset_to_dfu_response_id = 0x02,
};

enum sli_bt_event_id
{
    sli_bt_dfu_boot_event_id = 0x00,
    sli_bt_dfu_boot_failure_event_id = 0x01,
    sli_bt_system_boot_event_id = 0x00,
    sli_bt_system_error_event_id = 0x06,
    sli_bt_system_hardware_error_event_id = 0x05,
    sli_bt_system_external_signal_event_id = 0x03,
    sli_bt_system_awake_event_id = 0x04,
    sli_bt_system_soft_timer_event_id = 0x07,
    sli_bt_advertiser_timeout_event_id = 0x01,
    sli_bt_advertiser_scan_request_event_id = 0x02,
    sli_bt_periodic_advertiser_status_event_id = 0x00,
    sli_bt_scanner_legacy_advertisement_report_event_id = 0x00,
    sli_bt_scanner_extended_advertisement_report_event_id = 0x02,
    sli_bt_scanner_scan_report_event_id = 0x01,
    sli_bt_sync_opened_event_id = 0x00,
    sli_bt_sync_transfer_received_event_id = 0x03,
    sli_bt_sync_data_event_id = 0x02,
    sli_bt_sync_closed_event_id = 0x01,
    sli_bt_connection_opened_event_id = 0x00,
    sli_bt_connection_parameters_event_id = 0x02,
    sli_bt_connection_phy_status_event_id = 0x04,
    sli_bt_connection_rssi_event_id = 0x03,
    sli_bt_connection_get_remote_tx_power_completed_event_id = 0x05,
    sli_bt_connection_tx_power_event_id = 0x06,
    sli_bt_connection_remote_tx_power_event_id = 0x07,
    sli_bt_connection_closed_event_id = 0x01,
    sli_bt_connection_remote_used_features_event_id = 0x08,
    sli_bt_gatt_mtu_exchanged_event_id = 0x00,
    sli_bt_gatt_service_event_id = 0x01,
    sli_bt_gatt_characteristic_event_id = 0x02,
    sli_bt_gatt_descriptor_event_id = 0x03,
    sli_bt_gatt_characteristic_value_event_id = 0x04,
    sli_bt_gatt_descriptor_value_event_id = 0x05,
    sli_bt_gatt_procedure_completed_event_id = 0x06,
    sli_bt_gatt_server_attribute_value_event_id = 0x00,
    sli_bt_gatt_server_user_read_request_event_id = 0x01,
    sli_bt_gatt_server_user_write_request_event_id = 0x02,
    sli_bt_gatt_server_characteristic_status_event_id = 0x03,
    sli_bt_gatt_server_execute_write_completed_event_id = 0x04,
    sli_bt_gatt_server_indication_timeout_event_id = 0x05,
    sli_bt_test_dtm_completed_event_id = 0x00,
    sli_bt_sm_passkey_display_event_id = 0x00,
    sli_bt_sm_passkey_request_event_id = 0x01,
    sli_bt_sm_confirm_passkey_event_id = 0x02,
    sli_bt_sm_bonded_event_id = 0x03,
    sli_bt_sm_bonding_failed_event_id = 0x04,
    sli_bt_sm_confirm_bonding_event_id = 0x09,
    sli_bt_l2cap_le_channel_open_request_event_id = 0x01,
    sli_bt_l2cap_le_channel_open_response_event_id = 0x02,
    sli_bt_l2cap_channel_data_event_id = 0x03,
    sli_bt_l2cap_channel_credit_event_id = 0x04,
    sli_bt_l2cap_channel_closed_event_id = 0x05,
    sli_bt_l2cap_command_rejected_event_id = 0x06,
    sli_bt_cte_receiver_dtm_iq_report_event_id = 0x02,
    sli_bt_cte_receiver_connection_iq_report_event_id = 0x00,
    sli_bt_cte_receiver_connectionless_iq_report_event_id = 0x01,
    sli_bt_cte_receiver_silabs_iq_report_event_id = 0x03,
    sli_bt_user_message_to_host_event_id = 0x00,
};

PACKSTRUCT( struct sl_bt_rsp_error_s
{
    uint16_t            result;
});

typedef struct sl_bt_rsp_error_s sl_bt_rsp_error_t;

PACKSTRUCT( struct sl_bt_cmd_dfu_reset_s
{
    uint8_t dfu;
});

typedef struct sl_bt_cmd_dfu_reset_s sl_bt_cmd_dfu_reset_t;


PACKSTRUCT( struct sl_bt_cmd_dfu_flash_set_address_s
{
    uint32_t address;
});

typedef struct sl_bt_cmd_dfu_flash_set_address_s sl_bt_cmd_dfu_flash_set_address_t;


