espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_bt_api.h
PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_set_data_s
{
    uint8_t advertising_set;
    uint8_t type;
    uint8array data;
});

typedef struct sl_bt_cmd_legacy_advertiser_set_data_s sl_bt_cmd_legacy_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_generate_data_s
{
    uint8_t advertising_set;
    uint8_t discover;
});

typedef struct sl_bt_cmd_legacy_advertiser_generate_data_s sl_bt_cmd_legacy_advertiser_generate_data_t;


PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_start_s
{
    uint8_t advertising_set;
    uint8_t connect;
});

typedef struct sl_bt_cmd_legacy_advertiser_start_s sl_bt_cmd_legacy_advertiser_start_t;


PACKSTRUCT( struct sl_bt_cmd_legacy_advertiser_start_directed_s
{
    uint8_t advertising_set;
    uint8_t connect;
    bd_addr peer_addr;
    uint8_t peer_addr_type;
});

typedef struct sl_bt_cmd_legacy_advertiser_start_directed_s sl_bt_cmd_legacy_advertiser_start_directed_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_set_phy_s
{
    uint8_t advertising_set;
    uint8_t primary_phy;
    uint8_t secondary_phy;
});

typedef struct sl_bt_cmd_extended_advertiser_set_phy_s sl_bt_cmd_extended_advertiser_set_phy_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_set_data_s
{
    uint8_t advertising_set;
    uint8array data;
});

typedef struct sl_bt_cmd_extended_advertiser_set_data_s sl_bt_cmd_extended_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_set_long_data_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_extended_advertiser_set_long_data_s sl_bt_cmd_extended_advertiser_set_long_data_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_generate_data_s
{
    uint8_t advertising_set;
    uint8_t discover;
});

typedef struct sl_bt_cmd_extended_advertiser_generate_data_s sl_bt_cmd_extended_advertiser_generate_data_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_start_s
{
    uint8_t advertising_set;
    uint8_t connect;
    uint32_t flags;
});

typedef struct sl_bt_cmd_extended_advertiser_start_s sl_bt_cmd_extended_advertiser_start_t;


PACKSTRUCT( struct sl_bt_cmd_extended_advertiser_start_directed_s
{
    uint8_t advertising_set;
    uint8_t connect;
    uint32_t flags;
    bd_addr peer_addr;
    uint8_t peer_addr_type;
});

typedef struct sl_bt_cmd_extended_advertiser_start_directed_s sl_bt_cmd_extended_advertiser_start_directed_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_set_data_s
{
    uint8_t advertising_set;
    uint8array data;
});

typedef struct sl_bt_cmd_periodic_advertiser_set_data_s sl_bt_cmd_periodic_advertiser_set_data_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_set_long_data_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_periodic_advertiser_set_long_data_s sl_bt_cmd_periodic_advertiser_set_long_data_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_start_s
{
    uint8_t advertising_set;
    uint16_t interval_min;
    uint16_t interval_max;
    uint32_t flags;
});

typedef struct sl_bt_cmd_periodic_advertiser_start_s sl_bt_cmd_periodic_advertiser_start_t;


PACKSTRUCT( struct sl_bt_cmd_periodic_advertiser_stop_s
{
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_periodic_advertiser_stop_s sl_bt_cmd_periodic_advertiser_stop_t;


PACKSTRUCT( struct sl_bt_cmd_scanner_set_parameters_s
{
    uint8_t mode;
    uint16_t interval;
    uint16_t window;
});

typedef struct sl_bt_cmd_scanner_set_parameters_s sl_bt_cmd_scanner_set_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_scanner_set_timing_s
{
    uint8_t phys;
    uint16_t scan_interval;
    uint16_t scan_window;
});

typedef struct sl_bt_cmd_scanner_set_timing_s sl_bt_cmd_scanner_set_timing_t;


PACKSTRUCT( struct sl_bt_cmd_scanner_set_mode_s
{
    uint8_t phys;
    uint8_t scan_mode;
});

typedef struct sl_bt_cmd_scanner_set_mode_s sl_bt_cmd_scanner_set_mode_t;


PACKSTRUCT( struct sl_bt_cmd_scanner_start_s
{
    uint8_t scanning_phy;
    uint8_t discover_mode;
});

typedef struct sl_bt_cmd_scanner_start_s sl_bt_cmd_scanner_start_t;


PACKSTRUCT( struct sl_bt_cmd_sync_set_parameters_s
{
    uint16_t skip;
    uint16_t timeout;
    uint32_t flags;
});

typedef struct sl_bt_cmd_sync_set_parameters_s sl_bt_cmd_sync_set_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_sync_open_s
{
    bd_addr address;
    uint8_t address_type;
    uint8_t adv_sid;
});

typedef struct sl_bt_cmd_sync_open_s sl_bt_cmd_sync_open_t;


PACKSTRUCT( struct sl_bt_cmd_sync_set_reporting_mode_s
{
    uint16_t sync;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_sync_set_reporting_mode_s sl_bt_cmd_sync_set_reporting_mode_t;


PACKSTRUCT( struct sl_bt_cmd_sync_close_s
{
    uint16_t sync;
});

typedef struct sl_bt_cmd_sync_close_s sl_bt_cmd_sync_close_t;


PACKSTRUCT( struct sl_bt_cmd_past_receiver_set_default_sync_receive_parameters_s
{
    uint8_t mode;
    uint16_t skip;
    uint16_t timeout;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_past_receiver_set_default_sync_receive_parameters_s sl_bt_cmd_past_receiver_set_default_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_past_receiver_set_sync_receive_parameters_s
{
    uint8_t connection;
    uint8_t mode;
    uint16_t skip;
    uint16_t timeout;
    uint8_t reporting_mode;
});

typedef struct sl_bt_cmd_past_receiver_set_sync_receive_parameters_s sl_bt_cmd_past_receiver_set_sync_receive_parameters_t;


PACKSTRUCT( struct sl_bt_cmd_advertiser_past_transfer_s
{
    uint8_t connection;
    uint16_t service_data;
    uint8_t advertising_set;
});

typedef struct sl_bt_cmd_advertiser_past_transfer_s sl_bt_cmd_advertiser_past_transfer_t;


PACKSTRUCT( struct sl_bt_cmd_sync_past_transfer_s
{
    uint8_t connection;
    uint16_t service_data;
    uint16_t sync;
});

typedef struct sl_bt_cmd_sync_past_transfer_s sl_bt_cmd_sync_past_transfer_t;


PACKSTRUCT( struct sl_bt_cmd_connection_set_default_parameters_s
{
    uint16_t min_interval;
    uint16_t max_interval;
    uint16_t latency;
    uint16_t timeout;
    uint16_t min_ce_length;
    uint16_t max_ce_length;
});

