espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sli_bt_api.h
typedef struct sl_bt_cmd_gatt_read_characteristic_value_by_uuid_s sl_bt_cmd_gatt_read_characteristic_value_by_uuid_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_write_characteristic_value_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_write_characteristic_value_s sl_bt_cmd_gatt_write_characteristic_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_write_characteristic_value_without_response_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_write_characteristic_value_without_response_s sl_bt_cmd_gatt_write_characteristic_value_without_response_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_prepare_characteristic_value_write_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint16_t offset;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_prepare_characteristic_value_write_s sl_bt_cmd_gatt_prepare_characteristic_value_write_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_prepare_characteristic_value_reliable_write_s
{
    uint8_t connection;
    uint16_t characteristic;
    uint16_t offset;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_prepare_characteristic_value_reliable_write_s sl_bt_cmd_gatt_prepare_characteristic_value_reliable_write_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_execute_characteristic_value_write_s
{
    uint8_t connection;
    uint8_t flags;
});

typedef struct sl_bt_cmd_gatt_execute_characteristic_value_write_s sl_bt_cmd_gatt_execute_characteristic_value_write_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_read_descriptor_value_s
{
    uint8_t connection;
    uint16_t descriptor;
});

typedef struct sl_bt_cmd_gatt_read_descriptor_value_s sl_bt_cmd_gatt_read_descriptor_value_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_write_descriptor_value_s
{
    uint8_t connection;
    uint16_t descriptor;
    uint8array value;
});

typedef struct sl_bt_cmd_gatt_write_descriptor_value_s sl_bt_cmd_gatt_write_descriptor_value_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_service_s
{
    uint16_t session;
    uint8_t type;
    uint8_t property;
    uint8array uuid;
});

typedef struct sl_bt_cmd_gattdb_add_service_s sl_bt_cmd_gattdb_add_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_service_s
{
    uint16_t session;
    uint16_t service;
});

typedef struct sl_bt_cmd_gattdb_remove_service_s sl_bt_cmd_gattdb_remove_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_included_service_s
{
    uint16_t session;
    uint16_t service;
    uint16_t included_service;
});

typedef struct sl_bt_cmd_gattdb_add_included_service_s sl_bt_cmd_gattdb_add_included_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_included_service_s
{
    uint16_t session;
    uint16_t attribute;
});

typedef struct sl_bt_cmd_gattdb_remove_included_service_s sl_bt_cmd_gattdb_remove_included_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid16_characteristic_s
{
    uint16_t session;
    uint16_t service;
    uint16_t property;
    uint16_t security;
    uint8_t flag;
    sl_bt_uuid_16_t uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid16_characteristic_s sl_bt_cmd_gattdb_add_uuid16_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid128_characteristic_s
{
    uint16_t session;
    uint16_t service;
    uint16_t property;
    uint16_t security;
    uint8_t flag;
    uuid_128 uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid128_characteristic_s sl_bt_cmd_gattdb_add_uuid128_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_characteristic_s
{
    uint16_t session;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gattdb_remove_characteristic_s sl_bt_cmd_gattdb_remove_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid16_descriptor_s
{
    uint16_t session;
    uint16_t characteristic;
    uint16_t property;
    uint16_t security;
    sl_bt_uuid_16_t uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid16_descriptor_s sl_bt_cmd_gattdb_add_uuid16_descriptor_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_add_uuid128_descriptor_s
{
    uint16_t session;
    uint16_t characteristic;
    uint16_t property;
    uint16_t security;
    uuid_128 uuid;
    uint8_t value_type;
    uint16_t maxlen;
    byte_array value;
});

typedef struct sl_bt_cmd_gattdb_add_uuid128_descriptor_s sl_bt_cmd_gattdb_add_uuid128_descriptor_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_remove_descriptor_s
{
    uint16_t session;
    uint16_t descriptor;
});

typedef struct sl_bt_cmd_gattdb_remove_descriptor_s sl_bt_cmd_gattdb_remove_descriptor_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_start_service_s
{
    uint16_t session;
    uint16_t service;
});

typedef struct sl_bt_cmd_gattdb_start_service_s sl_bt_cmd_gattdb_start_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_stop_service_s
{
    uint16_t session;
    uint16_t service;
});

typedef struct sl_bt_cmd_gattdb_stop_service_s sl_bt_cmd_gattdb_stop_service_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_start_characteristic_s
{
    uint16_t session;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gattdb_start_characteristic_s sl_bt_cmd_gattdb_start_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_stop_characteristic_s
{
    uint16_t session;
    uint16_t characteristic;
});

typedef struct sl_bt_cmd_gattdb_stop_characteristic_s sl_bt_cmd_gattdb_stop_characteristic_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_commit_s
{
    uint16_t session;
});

typedef struct sl_bt_cmd_gattdb_commit_s sl_bt_cmd_gattdb_commit_t;


PACKSTRUCT( struct sl_bt_cmd_gattdb_abort_s
{
    uint16_t session;
});

typedef struct sl_bt_cmd_gattdb_abort_s sl_bt_cmd_gattdb_abort_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_set_max_mtu_s
{
    uint16_t max_mtu;
});

typedef struct sl_bt_cmd_gatt_server_set_max_mtu_s sl_bt_cmd_gatt_server_set_max_mtu_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_get_mtu_s
{
    uint8_t connection;
});

typedef struct sl_bt_cmd_gatt_server_get_mtu_s sl_bt_cmd_gatt_server_get_mtu_t;


PACKSTRUCT( struct sl_bt_cmd_gatt_server_find_attribute_s
{
    uint16_t start;
    uint8array type;
});

typedef struct sl_bt_cmd_gatt_server_find_attribute_s sl_bt_cmd_gatt_server_find_attribute_t;


